viscoelastic/viscoelasticFluidFoam/profileExtrusion/1M_fixedIter/system/meshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceFile         "total.fms";

maxCellSize         0.155;

objectRefinements
{
    parallelZone
    {
        type        box;
        cellSize    0.12;
        centre      (0 0 40);
        lengthX     20;
        lengthY     20;
        lengthZ     22;
    }
}

// ************************************************************************* //
